USE fitness_adaptive_system;

INSERT INTO exercises (name, muscle_group, exercise_type) VALUES
('Лежанка с щанга', 'Гърди', 'Базово'),
('Полулег с дъмбели', 'Гърди', 'Базово'),
('Пек дек', 'Гърди', 'Изолиращо'),
('Кросоувър на скрипец', 'Гърди', 'Изолиращо'),

('Гребане с щанга', 'Гръб', 'Базово'),
('Скрипец отпред', 'Гръб', 'Базово'),
('Гребане на машина', 'Гръб', 'Базово'),
('Пулоувър на скрипец', 'Гръб', 'Изолиращо'),

('Клек с щанга', 'Крака', 'Базово'),
('Хак клек', 'Крака', 'Базово'),
('Лег преса', 'Крака', 'Базово'),
('Бедрено разгъване', 'Крака', 'Изолиращо'),
('Бедрено сгъване', 'Крака', 'Изолиращо'),
('Повдигане за прасци', 'Крака', 'Изолиращо'),

('Раменна преса с дъмбели', 'Рамо', 'Базово'),
('Раменна преса на машина', 'Рамо', 'Базово'),
('Странично разтваряне', 'Рамо', 'Изолиращо'),
('Задно рамо на машина', 'Рамо', 'Изолиращо'),

('Сгъване с дъмбели', 'Бицепс', 'Изолиращо'),
('Сгъване с EZ лост', 'Бицепс', 'Изолиращо'),
('Скотово сгъване', 'Бицепс', 'Изолиращо'),

('Трицепсово разгъване на скрипец', 'Трицепс', 'Изолиращо'),
('Френско разгъване', 'Трицепс', 'Изолиращо'),
('Кофички', 'Трицепс', 'Базово');